# 3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел. Проверить работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо только числами. Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например, команду «stop». При этом скрипт завершается, сформированный список с числами выводится на экран.
# Подсказка: для этого задания примем, что пользователь может вводить только числа и строки. Во время ввода пользователем очередного элемента необходимо реализовать проверку типа элемента. Вносить его в список, только если введено число. Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение. При этом работа скрипта не должна завершаться.
class Exception:
    def __init__(self, *args):
        self.my_list = []

    def mylist(self):
        while True:
            try:
                value = input('Введите число. Для остановки введите stop ')
                self.my_list.append(int(value))
            except:
                print(f'Вы ввели не число!')
            if value == 'stop':
                return f'Полученный список {self.my_list}'
                break


ex = Exception(1)
print(ex.mylist())
