# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
print((lambda a, b: a / b if b != 0 else print('На ноль делить нельзя! '))(int(input('Введите первое число ')), int(input('Введите второе число '))))